# CLI tools

brew "antidote"
brew "btop"
brew "fastfetch"
brew "fnm"
brew "fzf"
brew "mas"
brew "stow"
brew "tree"
brew "uv"

# Apps

cask "1password"
cask "alfred"
cask "anki"
cask "cleanshot"
cask "tailscale"
cask "visual-studio-code"
cask "zotero"

# Safari Extensions

mas "1Password for Safari", id: 1569813296
mas "Wipr", id: 1662217862
mas "StopTheMadness Pro", id: 6471380298
mas "Noir", id: 1592917505

# App Store Apps

mas "Bear", id: 1091189122
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Soulver 3", id: 1508732804
mas "Things", id: 904280696
mas "Xcode", id: 497799835

# VSCode setup

vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "vscodevim.vim"
